{
  "id": "case-002",
  "status": "approved",
  "title": "The Remote Worker",
  "difficulty": "intermediate",
  "region": "upper_quarter",
  "primaryConcepts": ["cervical_radiculitis", "brachial_plexus", "Wainner_cluster", "ULNTT", "DTM_shoulder", "failed_prior_treatment", "multi_level_nerve_sensitivity", "CAP", "ergonomics"],

  "presentation": {
    "demographics": {
      "age": 51,
      "sex": "Female",
      "occupation": "Marketing Director"
    },
    "chiefComplaint": "Right shoulder and arm pain for 4 months, worsening over past 6 weeks.",
    "hpiNarrative": "Ms. Garcia is a 51-year-old marketing director who presents with right shoulder and lateral arm pain that has been present for approximately 4 months but has significantly worsened over the past 6 weeks. The pain began insidiously with neck stiffness that she initially managed with weekly massage therapy. Since transitioning to full-time remote work 6 months ago, she has been working longer hours (50-60 hours/week) on a laptop at her kitchen table. She describes the pain as a deep ache in the posterior shoulder that radiates to the lateral arm, occasionally reaching the dorsum of her forearm. The pain is worse with overhead activities, reaching behind her back, and prolonged computer work. She notes the pain sometimes wakes her at night when she rolls onto her right side. She denies numbness or tingling but reports the arm occasionally feels 'heavy.' She previously received a diagnosis of rotator cuff impingement from her PCP and completed 6 weeks of physical therapy focusing on rotator cuff strengthening and stretching with minimal improvement. She was also previously diagnosed with carpal tunnel syndrome 3 years ago, treated conservatively with splinting.",
    "pastMedicalHistory": [
      "Carpal tunnel syndrome - right, diagnosed 3 years ago. Treated with night splinting for approximately 6 months with symptom resolution. Discontinued splint approximately 2 years ago. No active wrist or hand symptoms currently.",
      "Prior neck stiffness episodes - managed with massage",
      "Hyperlipidemia",
      "No spine imaging"
    ],
    "socialHistory": {
      "occupation": "Remote work, 50-60 hours/week at home workstation (kitchen table with laptop)",
      "exercise": "Previously attended gym 3x/week, stopped 8 months ago",
      "smoking": "Never",
      "alcohol": "1-2 glasses wine weekly",
      "stress": "High - increased workload, team management challenges"
    },
    "medicationsAllergies": {
      "current": ["Atorvastatin 20mg daily", "Acetaminophen PRN"],
      "allergies": "Sulfa drugs"
    }
  },

  "physicalExam": {
    "observation": "Sits with forward head posture and rounded shoulders. Right shoulder elevated compared to left. Holds right arm close to body. Frequent position changes during interview.",
    "cervicalROM": {
      "flexion": "Full, mild end-range discomfort",
      "extension": "Limited to approximately 60% with local neck pain",
      "rightRotation": "Limited to approximately 70% with right neck and shoulder pain",
      "leftRotation": "Full range",
      "rightLateralFlexion": "Limited to approximately 60%",
      "leftLateralFlexion": "Full range"
    },
    "shoulderROM": {
      "flexion": "160 degrees with pain arc 90-120 degrees",
      "abduction": "150 degrees with pain at 90-110 degrees",
      "internalRotation": "Markedly limited - hand reaches only to L3",
      "externalRotation": "Full range with mild discomfort"
    },
    "neurological": {
      "motorTesting": {
        "shoulderAbduction": "5/5 bilateral",
        "elbowFlexion": "5/5 bilateral",
        "elbowExtension": "5/5 bilateral",
        "wristExtension": "5/5 bilateral",
        "gripStrength": "5/5 bilateral"
      },
      "sensory": "Intact to light touch throughout, no dermatomal deficit",
      "reflexes": {
        "biceps": "2+ bilateral",
        "triceps": "2+ bilateral",
        "brachioradialis": "2+ bilateral"
      }
    },
    "specialTests": {
      "wainnerCluster": {
        "cervicalROM": "Asymmetric limitation - right rotation limited to approximately 70%, right lateral flexion limited to approximately 60%, extension limited to approximately 60%, all with right-sided neck and shoulder symptoms. Greater than 10 degrees asymmetry from side to side.",
        "spurlings": "Right lateral tilt to affected side, rotation away, then extension: positive for local neck pain, negative for reproduction of radicular arm symptoms. With overpressure applied: no change.",
        "cervicalDistraction": {
          "procedure": "Seated. Index movement (shoulder abduction) established at 100 degrees = 6/10 pain. Manual cervical traction applied while patient performs shoulder abduction.",
          "result": "Pain reduced from 6/10 to 2/10. Patient achieves abduction to 140 degrees before pain onset.",
          "interpretation": "Implicates the IVF as a contributor to shoulder symptoms"
        },
        "ULNTT_1_median": "Positive right. Shoulder blocked from elevation, arm abducted to 90-100 degrees, humerus externally rotated, wrist extended, elbow straightened — reproduces deep shoulder ache at full excursion. Adding contralateral cervical lateral flexion increases symptoms, demonstrating convergence (Shacklock) — tension applied from the cervical end of the neural tract meets the tension applied through the upper limb positioning, confirming the cervical spine as a proximal contributor. ULNTT #1 places the greatest tension on the brachial plexus region, which is why Wainner selected it for this cluster.",
        "clusterInterpretation": "3 of 4 positive (ROM, distraction, ULNTT #1). Per Wainner (2003), 3/4 positive yields approximately 94% specificity for cervical radiculopathy. 4/4 positive would yield approximately 99% specificity."
      },
      "sapsCluster": {
        "painfulArcAbduction": "Positive right - pain arc approximately 60-120 degrees on active abduction",
        "yocumsTest": "Positive right - hand placed on opposite shoulder, raising elbow reproduces deep shoulder ache",
        "activeInternalRotation": "Limited right - hand reaches L3 (left reaches T12). Discomfort at end range on right.",
        "resistedInfraspinatus": "Negative - 5/5 strength, painless bilaterally",
        "hawkinsKennedy": "Positive right - reproduces shoulder pain",
        "neersTest": "Positive right - reproduces shoulder pain",
        "clusterInterpretation": "Positive painful arc, Yocum's, Hawkins-Kennedy, and Neer's indicate subacromial compression. However, resisted infraspinatus is negative with full strength bilaterally. This pattern — positive compression tests with negative strength/resistance testing — is consistent with neurocentric-driven decentration rather than primary rotator cuff pathology."
      },
      "ULNTT_radial": "Positive right - reproduces lateral arm discomfort. Releasing wrist flexion reduces symptoms.",
      "ULNTT_ulnar": "Negative"
    },
    "ncaSpecificFindings": {
      "skinRolling": {
        "posteriorShoulder": "Over the quadrangular space: dense, non-pliable tissue with marked hyperalgesia",
        "supraclavicularRegion": "From behind the mid-belly of the SCM across the clavicle: matted down superficial fascia with tenderness bilaterally, worse on the right",
        "supraspinousFossa": "Near the distal spine of the scapula: tissue density with tenderness on the right",
        "cervicalParaspinals": "C5-7 right: mild hyperalgesia, tissue does not lift freely compared to left"
      },
      "directionalPreferenceTesting": {
        "note": "Each direction tested with a minimum of 10 reps of end-range loading to determine the symptom trend, per MDT protocol.",
        "cervicalRetractions": "Shoulder pain increased after 10 reps",
        "cervicalRetractionsWithExtension": "No significant change in shoulder symptoms",
        "cervicalRetractionsWithExtensionAndRightRotation": "Shoulder pain decreased after 10 reps. Shoulder abduction ROM improved."
      },
      "indexMovement": "Shoulder abduction - 6/10 pain at 100 degrees",
      "capDemonstration": {
        "baseline": "Shoulder abduction 6/10 pain at 100 degrees",
        "intervention1": "Seated manual cervical traction during abduction",
        "retest1": "Abduction pain reduced to 2/10, range improved to 140 degrees",
        "intervention2": "DTM to posterior shoulder over quadrangular space",
        "retest2": "Abduction pain reduced to 3/10 at 100 degrees without traction",
        "clinicalNote": "Both cervical traction and DTM independently improved the index movement, indicating multi-level neurological involvement. The IVF level and cutaneous level both contribute."
      }
    },
    "palpation": "Tenderness right upper trapezius, levator scapulae, infraspinatus. Nodular thickening posterior shoulder. Cervical paraspinal hypertonicity C4-7 right."
  },

  "socraticQuestions": [
    {
      "id": "q1",
      "phase": "assessment",
      "question": "This patient was previously diagnosed with rotator cuff impingement and treated accordingly without improvement. Using the GNE framework, organize your assessment findings from bigger neuro to smaller neuro. What does each level reveal?",
      "hints": [
        "Start at the brain level - what psychosocial factors from the history might contribute?",
        "What do the Wainner cluster findings tell you about the nerve root/IVF level?",
        "What do the ULNTT findings indicate about peripheral nerves?",
        "What did skin rolling reveal, and where specifically?"
      ],
      "expectedConcepts": [
        "Brain: High work stress, health anxiety from failed treatment and prior CTS diagnosis, deconditioning from 8 months without exercise, catastrophizing risk given worsening symptoms despite treatment",
        "Cellular: Sedentary since stopped exercising, high work stress, prolonged static postures - all systemic inflammatory contributors",
        "Spinal cord/nerve root/IVF: Wainner cluster 3/4 positive. Cervical distraction reduced abduction pain from 6/10 to 2/10 - strongly implicates the IVF. ULNTT #1 positive, and adding contralateral cervical lateral flexion increases symptoms — this demonstrates convergence (Shacklock), where tension applied from the cervical end of the neural tract meets tension applied through the upper limb, confirming the cervical spine as a proximal contributor",
        "Peripheral nerves: ULNTT radial positive reproducing lateral arm symptoms. ULNTT #1 (median) positive indicating brachial plexus involvement",
        "Cutaneous: Skin rolling over the posterior shoulder near the quadrangular space revealed dense, non-pliable tissue with hyperalgesia. Skin rolling across the clavicle from behind the SCM showed matted down superficial fascia. These findings indicate sensitized superficial neurology"
      ],
      "teachingPoint": "The GNE reveals multi-level involvement that the prior diagnosis of rotator cuff impingement missed entirely. The failed rotator cuff treatment makes sense - the primary driver is neurological, not primarily mesodermal. Each GNE level adds a piece of the puzzle: the IVF is a major contributor (distraction test), the peripheral nerve tracts are sensitized (ULNTTs), and the cutaneous neurology is involved (skin rolling). A single-structure diagnosis cannot account for all of these findings."
    },
    {
      "id": "q2",
      "phase": "assessment",
      "question": "Explain the significance of the cervical distraction response. When manual traction was applied and the patient performed shoulder abduction, pain dropped from 6/10 to 2/10. What does this tell you mechanically? How does this relate to the ULNTT findings?",
      "hints": [
        "What does traction do to the IVF?",
        "What happens to nerve root perfusion when the IVF opens?",
        "If nerve roots are irritated upstream, what happens to the peripheral nerve tracts downstream?",
        "Consider this patient's prior carpal tunnel diagnosis in light of these findings"
      ],
      "expectedConcepts": [
        "Cervical traction opens the IVF, reducing mechanical compression on nerve roots and improving perfusion of the vasa nervorum",
        "When traction dramatically improves the distal index movement (shoulder abduction 6/10 to 2/10), it strongly implicates the IVF/nerve root as a proximal driver of the shoulder symptoms",
        "When neurology is mechanically sensitized upstream at the IVF, axonal transport and perfusion are reduced along the entire peripheral nerve tract, making those nerves more mechanically sensitive and prone to irritation at interface points between the nerve and other tissues",
        "ULNTT #1 (median) positive. Adding contralateral cervical lateral flexion worsens symptoms — this is convergence (Shacklock), where tension from the cervical spine meets the tension already applied through the upper limb. This structural differentiation confirms the spinal level is involved.",
        "ULNTT radial positive reproducing lateral arm symptoms indicates the radial nerve tract is sensitized",
        "This patient's prior CTS diagnosis 3 years ago is consistent with a pattern of neural tract sensitivity - the median nerve was symptomatic then, and now the entire upper quarter neural system is involved"
      ],
      "teachingPoint": "When upstream irritation at the IVF reduces axonal transport and perfusion, the entire peripheral nerve tract becomes more mechanically sensitive and prone to irritation at interface points between the nerve and other tissues. The nerve is one continuous tissue from the nerve root to the fingertips. This explains why opening the IVF with traction has such a dramatic effect on shoulder symptoms - and it explains why this patient had carpal tunnel syndrome years before developing shoulder pain. The neural system was already sensitized; the poor ergonomic setup and deconditioning tipped it over."
    },
    {
      "id": "q3",
      "phase": "conceptualization",
      "question": "The SAPS cluster shows positive painful arc, Yocum's test, Hawkins-Kennedy, and Neer's — yet resisted infraspinatus is negative with full strength. Her prior physical therapist used similar impingement findings to justify a diagnosis of rotator cuff pathology. How does the neurocentric approach explain this pattern differently?",
      "hints": [
        "What does the negative resisted infraspinatus tell you about the rotator cuff tendons?",
        "What nerves innervate the shoulder capsule and the muscles around the glenohumeral joint?",
        "How might sensitized neurology affect muscle behavior around the shoulder?",
        "What happens to joint centration when muscles are guarding to protect nerves?"
      ],
      "expectedConcepts": [
        "Traditional mesodermal view: The SAPS cluster findings — positive painful arc, Yocum's, Hawkins-Kennedy, and Neer's — point to subacromial compression and rotator cuff pathology",
        "Problem: If the rotator cuff tendons were the primary issue, we would expect positive findings on resisted testing. Resisted infraspinatus is negative with full strength bilaterally — the cuff is structurally intact.",
        "Neurocentric view: The nerves innervating the shoulder capsule and surrounding muscles may be mechanically sensitive. When those nerves are unhappy, the muscles they innervate become protective - they guard.",
        "Muscles protect nerves (Elvey). Protective guarding of the shoulder muscles alters the normal centration of the humeral head in the glenoid.",
        "A decentrated humeral head creates impingement-like mechanics secondarily - the acromion compresses structures not because the tendons are pathological, but because the joint is not centrating properly due to neural-driven muscle guarding",
        "The skin rolling hyperalgesia over the posterior shoulder supports primary neural involvement at the cutaneous level, not tendon pathology"
      ],
      "teachingPoint": "The SAPS cluster can be positive for neurological reasons. Sensitized neurology alters motor programs and muscle recruitment, leading to joint decentration that creates secondary mechanical impingement. Treating the impingement without addressing the neural driver will fail - as it did in this patient's 6 weeks of rotator cuff-focused PT. The negative resisted infraspinatus is the key finding that should prompt the clinician to look beyond the mesodermal lens — the compression tests are positive because the joint is decentrated, not because the tendons are pathological."
    },
    {
      "id": "q4",
      "phase": "treatment",
      "question": "Demonstrate the Clinical Audit Process (CAP) for this patient. How do you sequence interventions from bigger to smaller neuro, and how do you use the index movement to validate each step?",
      "hints": [
        "What is the index movement and its baseline?",
        "Start with the biggest neuro - what did cervical traction do?",
        "What did directional preference testing show?",
        "What did DTM do to the index movement?"
      ],
      "expectedConcepts": [
        "Index movement: Shoulder abduction - 6/10 pain at 100 degrees. This is the benchmark for all retesting.",
        "Level 1 - IVF/nerve root (biggest neuro): Seated manual cervical traction while patient abducts → pain drops to 2/10, range improves to 140 degrees. The IVF is strongly implicated.",
        "Directional preference: Retractions alone worsened symptoms. Retractions with extension - no change. Retractions with extension AND right rotation improved symptoms. This is the directional preference for home exercise.",
        "Level 2 - Peripheral nerves: ULNTT radial and median were positive. Neurodynamic sliders could be applied and the index retested.",
        "Level 3 - Cutaneous (smallest neuro): DTM to the posterior shoulder over the quadrangular space → retest abduction → pain drops to 3/10 at baseline range. Cutaneous neurology is contributing.",
        "The CAP showed that BOTH the IVF level and the cutaneous level independently improved the index movement. This confirms multi-level neurological involvement and tells us both levels need to be addressed in treatment."
      ],
      "teachingPoint": "The CAP provides immediate, objective feedback at each neurological level. When shoulder abduction improved from 6/10 to 2/10 with cervical traction and independently to 3/10 after DTM, we have validated our neurocentric hypothesis at two levels. The patient sees the cause-and-effect - this builds confidence and rapport while guiding the treatment plan. If the impingement were truly structural, neither cervical traction nor DTM to the skin would change shoulder abduction."
    },
    {
      "id": "q5",
      "phase": "diagnosis",
      "question": "Formulate a working diagnosis using neurocentric terminology. How would you communicate this to the patient in language she can understand, especially given her frustration with the prior failed treatment?",
      "hints": [
        "What structures are primarily involved based on the GNE and CAP?",
        "Is this primarily ectodermal or mesodermal?",
        "How do you reframe the failed rotator cuff treatment in a way that validates her experience?",
        "What does this diagnosis mean for her prognosis?"
      ],
      "expectedConcepts": [
        "Working diagnosis: Cervical radiculitis with secondary upper quarter neural tract sensitivity and cutaneous nerve involvement at the shoulder",
        "This is primarily an ectodermal (neurological) condition, not mesodermal (structural shoulder)",
        "The impingement findings are secondary to neural-driven motor control dysfunction - a combo platter where the neuro is driving the mechanical problem",
        "Patient communication: 'The nerves from your neck that go to your shoulder and arm have become irritated, likely from working at your kitchen table for long hours. This irritation is causing your shoulder muscles to tighten up to protect those nerves, which makes your shoulder not move properly. The good news is that when we created space in your neck with traction, your shoulder immediately felt better - that tells us the nerves are the main issue, not a torn rotator cuff. The previous treatment focused on the wrong thing.'",
        "Reframing the prior failed treatment: It was not the wrong effort - it was aimed at the wrong target. The rotator cuff was never the primary problem.",
        "Prognosis: Significantly better than true rotator cuff pathology. Major improvement expected in days to weeks with appropriate neural-focused intervention, not months."
      ],
      "teachingPoint": "Reframing the diagnosis changes everything - treatment approach, prognosis, and the patient's understanding of their own body. Telling Ms. Garcia that her nerves are irritated and that's why her shoulder isn't working properly validates her experience of failed treatment while giving her hope. The within-visit CAP demonstration already showed her that cervical traction and DTM improved her shoulder - she has evidence that this explanation is correct."
    },
    {
      "id": "q6",
      "phase": "homeExercise",
      "question": "Design a home exercise program for this patient. Include directional preference exercises, self-DTM techniques, ergonomic modifications, and clear dosing instructions.",
      "hints": [
        "Based on directional preference testing, what specific cervical exercise improved her shoulder?",
        "Can the patient perform self-DTM? Where and how?",
        "What ergonomic changes are critical given her work setup?",
        "What should she avoid, and what is the return-to-exercise progression?"
      ],
      "expectedConcepts": [
        "Directional preference exercise: Cervical retractions with extension and right rotation, 10 reps every 2 hours. This was the specific combination that improved shoulder symptoms.",
        "Self-DTM: Teach patient to perform skin traction over posterior shoulder using opposite hand - lift and hold the tissue while gently moving the arm through a comfortable range of abduction. 30-60 seconds, 3-4 times daily. Also teach self-DTM across the supraclavicular region.",
        "Ergonomic modifications (critical - this is the primary environmental driver): External monitor at eye level, external keyboard and mouse, chair with proper lumbar support at correct desk height. She cannot continue working on a laptop at a kitchen table.",
        "Movement breaks: Every 30-45 minutes, perform cervical retractions and shoulder rolls. Stand and change position.",
        "Avoid: Prolonged static postures, sleeping on right side (use pillow to prevent rolling), heavy overhead lifting until symptoms resolve",
        "Return to exercise: Start with walking. Gradually reintroduce gym with attention to posture. Avoid loaded overhead pressing until pain-free abduction is restored."
      ],
      "teachingPoint": "The home program addresses all contributing factors: neural mobilization (directional preference exercises), cutaneous desensitization (self-DTM), and environmental modification (ergonomics). The ergonomic setup is not optional - it is the primary environmental driver of her condition. She must understand that the home exercises ARE the treatment. Clinic visits reinforce and progress the program, but the 50-60 hours per week at her workstation will determine the outcome."
    },
    {
      "id": "q7",
      "phase": "integration",
      "question": "Ms. Garcia was diagnosed with carpal tunnel syndrome 3 years ago, and now presents with cervical radiculitis and shoulder symptoms. How does her history inform your understanding of the current presentation? If she returns in 3 weeks with improved shoulder symptoms but reports her old carpal tunnel tingling has returned, what does that tell you?",
      "hints": [
        "Think about the neural tract as one continuous tissue from nerve root to fingertips",
        "If the nerve is sensitized upstream, what happens downstream?",
        "What does the return of CTS symptoms suggest about the current treatment?",
        "How would you modify the treatment plan?"
      ],
      "expectedConcepts": [
        "The prior CTS and current cervical radiculitis with shoulder involvement are not separate diagnoses - they represent sensitivity along the same neural tract at different times and different levels",
        "When neurology is mechanically sensitized upstream at the IVF, the entire peripheral nerve tract becomes more mechanically sensitive and prone to irritation at interface points between the nerve and other tissues — tunnels, fascial layers, and muscle bellies",
        "Her CTS 3 years ago may have been an early signal that the cervical spine and brachial plexus area were already sensitized, making the median nerve prone to irritation at the carpal tunnel interface. The poor ergonomic setup escalated the upstream irritation until the shoulder became symptomatic.",
        "If CTS tingling returns while shoulder improves: the cervical treatment is mobilizing the nerve root and trunk, which is changing the mechanical environment along the entire tract. The median nerve at the carpal tunnel may temporarily become more symptomatic as the system reorganizes.",
        "This is NOT a setback - it is consistent with the multi-level model. Continue cervical directional preference exercises, add median nerve sliders if indicated, ensure the wrist splint is available for night use.",
        "Long-term: once the cervical driver is resolved, the downstream mechanical sensitivity at the carpal tunnel should also resolve - if the nerve root has adequate perfusion and axonal transport, the peripheral nerve is more resilient at its interface points."
      ],
      "teachingPoint": "NCA teaches clinicians to think in terms of the entire neural tract, not isolated diagnoses. Ms. Garcia's 'carpal tunnel' and 'shoulder impingement' and 'neck stiffness' are chapters in the same story - progressive sensitization of the upper quarter neural system. Treating each in isolation (splint for wrist, rotator cuff exercises for shoulder, massage for neck) missed the unifying mechanism. The NCA framework connects these dots and provides a coherent treatment strategy that addresses the upstream driver."
    }
  ],

  "keyTakeaways": [
    "Failed treatment should prompt reassessment through the neurocentric lens - the prior treatment may have been aimed at the wrong target",
    "The Wainner cluster (cervical ROM, Spurling's, distraction, ULNTT #1) is the structured starting point for upper quarter assessment. 3/4 positive yields approximately 94% specificity for cervical radiculopathy.",
    "SAPS cluster tests (painful arc, Yocum's, Hawkins-Kennedy, Neer's) can be positive for neurological reasons — sensitized nerves cause protective muscle guarding that decentrates the humeral head, creating secondary impingement. Negative resisted infraspinatus with positive compression tests is the key pattern.",
    "The GNE reveals multi-level involvement that single-structure diagnoses miss. Assess from bigger neuro to smaller neuro.",
    "When neurology is sensitized upstream at the IVF, the entire peripheral nerve tract becomes more mechanically sensitive and prone to irritation at interface points between the nerve and other tissues. Prior diagnoses along the same neural tract (e.g., CTS) may be related.",
    "The CAP validates clinical reasoning with objective within-session changes at each neurological level",
    "DTM addresses cutaneous nerve involvement not reached by traditional soft tissue techniques",
    "Ergonomic modification is not optional when the work environment is the primary driver"
  ],

  "paceMetadata": {
    "learningObjectives": [
      "Apply the Wainner cluster and GNE framework to organize multi-level neurological findings in the upper quarter",
      "Explain how upstream nerve root irritation makes the entire peripheral nerve tract more mechanically sensitive and prone to irritation at tissue interface points",
      "Differentiate neurocentric shoulder pathology from traditional rotator cuff impingement using orthopedic test interpretation",
      "Demonstrate the Clinical Audit Process (CAP) for sequencing upper quarter interventions from bigger to smaller neuro",
      "Design an ergonomic-informed home program addressing cervical, peripheral, and cutaneous nerve involvement"
    ],
    "creditHours": 1.0,
    "estimatedMinutes": 50,
    "creditHourJustification": "Case includes 7 Socratic questions covering assessment, conceptualization, diagnosis, treatment, home exercise, and integration phases with emphasis on failed prior treatment reframing and multi-level neural tract sensitivity.",
    "targetAudience": "Licensed chiropractors, physical therapists, osteopaths, and other neuromusculoskeletal clinicians",
    "prerequisites": "Basic neuromusculoskeletal assessment skills; familiarity with cervical spine and upper extremity anatomy",
    "author": { "name": "Dr. Patrick Snell", "credentials": "DC" },
    "conflictOfInterest": "Dr. Patrick Snell is the developer of the NeuroCentric Approach methodology and owner of Solutions Sports and Spine.",
    "educationalMethods": ["case-based learning", "Socratic questioning", "self-assessment"],
    "completionCriteria": {
      "allQuestionsAnswered": true,
      "selfAssessmentRequired": true,
      "postActivityEvaluationRequired": true,
      "minimumActiveMinutes": 50
    }
  },

  "references": [
    "Shacklock M. Clinical Neurodynamics",
    "Butler D. The Sensitive Nervous System",
    "Elvey RL. Treatment of arm pain associated with abnormal brachial plexus tension",
    "Wainner RS et al. Reliability and diagnostic accuracy of the clinical examination and patient self-report measures for cervical radiculopathy. Spine. 2003;28(1):52-62",
    "NCA Shoulder Module - Overview, Assessment, Manual, Exercise",
    "NCA DTM Chapter 2 - Shoulder",
    "NCA Theory Module 1 - Introduction"
  ]
}
