{
  "id": "draft-001",
  "status": "draft",
  "title": "The Weekend Warrior",
  "difficulty": "intermediate",
  "region": "lower_quarter",
  "primaryConcepts": ["disc_herniation", "radiculopathy", "McKenzie", "directional_preference", "hip_hinge", "patient_agency"],

  "presentation": {
    "demographics": {
      "age": 42,
      "sex": "Male",
      "occupation": "Accountant"
    },
    "chiefComplaint": "Right-sided low back pain radiating to the posterior thigh, present for 3 weeks.",
    "hpiNarrative": "Mr. Thompson is a 42-year-old accountant who presents with right-sided low back pain that began 3 weeks ago after helping a friend move furniture. He describes lifting a heavy dresser with a rounded back when he felt a 'pop' in his lower back followed by immediate sharp pain. Initially the pain was localized to his low back, but over the following week it began radiating down the posterior aspect of his right thigh to just above the knee. The pain is worse with sitting, forward bending, and first thing in the morning. He reports the pain improves somewhat when walking and when lying on his left side with a pillow between his knees. He rates the pain 7/10 at worst and describes it as a deep ache with occasional sharp shooting sensations down the leg. He denies bowel or bladder changes, saddle anesthesia, or bilateral leg symptoms. He has been taking ibuprofen 600mg TID with minimal relief.",
    "pastMedicalHistory": [
      "Hypertension - controlled with lisinopril",
      "Two prior episodes of low back pain (5 years ago, 2 years ago) - both resolved with rest and NSAIDs within 2 weeks",
      "No prior spine imaging",
      "No surgeries"
    ],
    "socialHistory": {
      "occupation": "Desk job, sits 8-10 hours/day",
      "exercise": "Plays recreational basketball on weekends, occasional gym workouts",
      "smoking": "Never",
      "alcohol": "Social, 2-3 beers on weekends"
    },
    "medicationsAllergies": {
      "current": ["Lisinopril 10mg daily", "Ibuprofen 600mg TID PRN"],
      "allergies": "NKDA"
    }
  },

  "physicalExam": {
    "observation": "Patient enters slowly, guarding right side. Stands with reduced lumbar lordosis and slight left lateral shift. Sits gingerly on edge of chair, frequently shifts position.",
    "activeROM": {
      "flexion": "Hesitant, markedly limited excursion with Gower's sign. Deviation to left. Reproduces CC back and posterior thigh pain.",
      "extension": "Painful and limited on initial rep. Patient guards and is apprehensive.",
      "rightLateralFlexion": "Limited with local pain",
      "leftLateralFlexion": "Full range, no pain",
      "rightRotation": "Mildly limited",
      "leftRotation": "Full range"
    },
    "neurological": {
      "motorTesting": {
        "hipFlexion": "5/5 bilateral",
        "kneeExtension": "5/5 bilateral",
        "ankleDF": "5/5 bilateral",
        "anklePF": "5/5 bilateral",
        "EHL": "5/5 bilateral"
      },
      "sensory": "Subjective decreased sensation posterior thigh R > L",
      "reflexes": {
        "patellar": "2+ bilateral",
        "achilles": "2+ bilateral"
      }
    },
    "specialTests": {
      "seatedSlump": "Positive right - reproduces posterior thigh pain, reduced with cervical extension",
      "straightLegRaise": "Positive at 45 degrees right, 80 degrees left",
      "crossedSLR": "Negative",
      "proneInstabilityTest": "Negative",
      "FABER": "Negative bilateral",
      "laslett_SI_cluster": {
        "thighThrust": "Negative",
        "sacralDistraction": "Negative",
        "dropTest": "Negative",
        "gaenslens": "Negative bilateral",
        "siCompression": "Negative",
        "sacralThrust": "Negative",
        "interpretation": "0/6 positive - SI joint ruled out as primary pain generator"
      }
    },
    "ncaSpecificFindings": {
      "skinRolling": {
        "lumbar": "Hyperalgesia over right L4-S1 paraspinals",
        "gluteal": "Mild hyperalgesia right superior gluteal region"
      },
      "mdtResponse": {
        "note": "MDT (Mechanical Diagnosis and Therapy) is synonymous with McKenzie. A minimum of 10 reps of end-range loading in a given vector is required to determine the symptom trend.",
        "repeatedFlexionInStanding": "Peripheralization - posterior thigh symptoms increase over 10 reps of repeated end-range flexion",
        "repeatedExtensionInLying": "Centralization - posterior thigh symptoms progressively regress and abolish over 10 reps of prone press-ups. Mild local LBP remains.",
        "clinicalNote": "Centralization is observed over multiple reps, not on a single rep. When leg symptoms regress after repeated end-range extension loading, extension IS the directional preference. This is the key finding."
      },
      "indexMovement": "Seated slump test - reproduces posterior thigh pain in a controlled, repeatable manner. In acute severe cases, using a controlled exam procedure as the index is preferred over provocative functional movements like forward bending, which can set the patient back if not carefully performed.",
      "capDemonstration": {
        "baseline": "Seated slump test reproduces posterior thigh pain",
        "intervention": "10 reps prone press-ups (repeated end-range extension loading)",
        "retest": "Seated slump test - reduced reproduction of posterior thigh pain",
        "patientResponse": "Patient visibly surprised and relieved - 'I can't believe that worked so fast'",
        "clinicalNote": "This within-visit demonstration builds patient agency and confidence. Any exam procedure that clearly reproduced symptoms (seated slump, SLR, or forward bending) may serve as the index for retest."
      }
    },
    "palpation": "Tenderness over right L4-5 and L5-S1 facets, paraspinal hypertonicity R > L, no step-off"
  },

  "socraticQuestions": [
    {
      "id": "q1",
      "phase": "assessment",
      "question": "Based on the history, what red flags should you specifically screen for in this patient? Name at least 3 and explain why they are relevant.",
      "hints": [
        "Consider the age and onset pattern",
        "What symptoms would indicate cauda equina syndrome?",
        "What in his history might warrant imaging?"
      ],
      "expectedConcepts": [
        "Cauda equina syndrome (saddle anesthesia, bowel/bladder dysfunction, bilateral symptoms) - patient denies all",
        "Progressive neurological deficit - motor testing intact",
        "Cancer (though less likely at age 42 without red flag history)",
        "Infection (no fever, no risk factors reported)"
      ],
      "teachingPoint": "Red flag screening should be performed on every patient with spinal pain. While this patient has radicular symptoms, he denies cauda equina signs. The mechanism of injury (lifting) and pattern of symptoms are consistent with mechanical etiology rather than sinister pathology."
    },
    {
      "id": "q2",
      "phase": "assessment",
      "question": "Organize your neurological findings using the Graded Neuro Exam (GNE) framework. What does each level tell you?",
      "hints": [
        "Start with brain-level factors from history",
        "What does the slump test tell you about the spinal cord/nerve root/IVF level?",
        "What do the skin rolling findings suggest?"
      ],
      "expectedConcepts": [
        "Brain: Prior episodes resolved - no catastrophizing evident, appropriate health-seeking behavior, realistic expectations",
        "Cellular: Sedentary lifestyle, high-stress occupation may contribute to inflammatory load",
        "Spinal cord/nerve root/IVF: Positive slump and SLR with cervical modulation indicates nerve root involvement, likely L5 or S1 based on distribution",
        "Peripheral nerves: Sciatic tract involvement demonstrated by tension tests",
        "Cutaneous: Hyperalgesia on skin rolling suggests sensitized superficial neurology in affected region"
      ],
      "teachingPoint": "The GNE organizes our neurological assessment from bigger to smaller structures. This patient shows involvement at the nerve root level (positive tension tests with proximal modulation) and secondary cutaneous sensitization."
    },
    {
      "id": "q3",
      "phase": "conceptualization",
      "question": "Contrast the traditional 'mesodermal lens' versus 'neurocentric lens'. Then, how would you explain to Mr. Thompson WHY his back became painful in language he can understand?",
      "hints": [
        "What would a purely structural/mechanical diagnosis focus on?",
        "How does the NCA framework reframe the tight paraspinals?",
        "How would you explain to the patient why extension exercises help?"
      ],
      "expectedConcepts": [
        "Mesodermal lens: Disc herniation causing mechanical compression, tight muscles are the problem requiring release, joint dysfunction requiring manipulation",
        "Neurocentric lens: Nerve root is mechanically sensitized (reduced perfusion from compression), paraspinal hypertonicity is protective (muscles protect nerves), need to reduce threat to neurology rather than force muscle relaxation",
        "Treatment implications: NCA approach focuses on reducing neural threat through positioning/movement (MDT/McKenzie) before aggressive soft tissue work that might increase threat",
        "Disc mechanics: Moving into extension repetitively in this case can push the disc contents away from the nerve roots and spinal cord, reducing threat. Note that the degree of nucleus pulposus migration is highly dependent on the chronological age and injury age of the individual.",
        "Patient education: Explain that the extension exercises reduce threat to the nerve. The tight back muscles are protective - they are guarding the irritated nerve, which is actually helpful right now.",
        "Frame the exercises as medicine - dose them throughout the day to manage symptoms and reduce threat to the nerve."
      ],
      "teachingPoint": "The patient needs a mental model for WHY the exercises work. Explaining that repeated extension can push disc contents away from the nerve, reducing threat, gives them a cause-and-effect understanding. Explaining that their tight muscles are protective (not the enemy) reframes their experience and builds trust. This narrative gives them agency."
    },
    {
      "id": "q4",
      "phase": "diagnosis",
      "question": "What is your working diagnosis? How does the McKenzie response inform your clinical reasoning?",
      "hints": [
        "What does peripheralization indicate?",
        "What does centralization indicate?",
        "What is the directional preference?"
      ],
      "expectedConcepts": [
        "Working diagnosis: Lumbar disc herniation with right L5 or S1 radiculopathy",
        "MDT (McKenzie): A minimum of 10 reps of end-range loading in a given vector is required to determine the symptom trend - this is a core MDT principle the clinician must understand",
        "Peripheralization with repeated flexion confirms disc as pain generator (flexion increases intradiscal pressure and posteriorly displaces nuclear material)",
        "Centralization with repeated extension indicates extension IS the directional preference - this is the KEY finding. Centralization is observed over multiple reps, not on a single rep.",
        "Centralization is a strong positive prognostic indicator for conservative care",
        "Negative Laslett cluster (0/6 tests positive) rules out SI joint as primary pain generator",
        "The combination of centralizing symptoms + negative SI cluster strongly supports discogenic origin"
      ],
      "teachingPoint": "MDT (synonymous with McKenzie) response is diagnostic and prognostic. Centralization requires at least 10 reps of end-range loading to determine the trend - a single rep is insufficient. When leg symptoms regress with repeated extension, extension IS the directional preference - that's the home exercise. Don't overcomplicate with lateral components unless extension alone fails to centralize. The negative Laslett SI cluster helps rule out SI joint involvement."
    },
    {
      "id": "q5",
      "phase": "treatment",
      "question": "Design a treatment plan using the Clinical Audit Process (CAP). How will you demonstrate immediate symptom modification to build patient agency?",
      "hints": [
        "What is the index movement?",
        "How do you demonstrate cause-and-effect to the patient?",
        "What is the sequence of interventions based on GNE levels?"
      ],
      "expectedConcepts": [
        "Index: Use a controlled exam procedure that clearly reproduced symptoms - seated slump, SLR, or forward bending may all serve as the index. In acute severe cases, a controlled test (e.g., seated slump) is preferred over provocative functional movements like forward bending, which can set the patient back.",
        "CRITICAL: Demonstrate symptom modification IN THE VISIT - this builds patient agency",
        "CAP demonstration: Establish baseline with index test → perform 10 prone press-ups → immediately retest index → patient experiences reduced symptom reproduction",
        "Patient sees cause-and-effect: 'When I do this exercise, my symptoms decrease' - this develops locus of control",
        "The patient's surprised response ('I can't believe that worked') is the moment of buy-in",
        "Sequence if needed: Address nerve root level first (MDT/McKenzie), then peripheral (neurodynamics), then cutaneous (DTM)",
        "Manual therapy: Consider manipulation after directional preference confirmed, DTM to hyperalgesic areas after neural threat reduced"
      ],
      "teachingPoint": "The within-visit symptom modification demonstration is TRANSFORMATIVE. When you establish a baseline with a controlled exam procedure, perform the press-ups, then retest and the patient experiences reduced symptom reproduction - they now believe they can influence their pain. This is patient agency. Without this demonstration, you're asking them to trust exercises they haven't seen work."
    },
    {
      "id": "q6",
      "phase": "homeExercise",
      "question": "What home exercise prescription would you provide? Include directional preference exercises, specific ADL modifications, and the functional training progression for correcting faulty movement patterns.",
      "hints": [
        "How do you dose the directional preference exercise?",
        "What specific ADLs need modification and how?",
        "What is the progression for retraining forward bending and lifting?"
      ],
      "expectedConcepts": [
        "DIRECTIONAL PREFERENCE (PPUs): Early in care, prone press-ups (PPUs) may be performed as often as hourly to reduce threat and pain. They are the primary tool for symptom management and breakthrough pain. As symptoms resolve, reduce PPU frequency and shift focus to avoiding known provocative activities/movements and getting stronger overall.",
        "Morning routine: Cat/Camel mobilizations before getting out of bed (the spine is more hydrated and vulnerable in AM)",
        "ADL MODIFICATIONS:",
        "- Brushing teeth: Hip hinge at sink, not spinal flexion - 'nose over toes, butt back'",
        "- Picking up objects: Golfer's pick-up (one leg back) or reverse lunge for light items",
        "- Putting on shoes: Sit down or use long-handled shoe horn - no flexed spine loading",
        "- Getting out of chair: Nose over toes, push through heels, maintain lordosis",
        "- Toilet: Use armrests to lower/rise, maintain lordosis",
        "FUNCTIONAL TRAINING PROGRESSION (Correct Faulty Movement):",
        "Phase 1 - Hip Hinge: Teach sparing strategy - 'chest up, butt back, weight on heels'. Use dowel on spine to monitor neutral. This replaces flexion-based bending.",
        "Phase 2 - Box Squat: Two fingers on L3-5 to monitor lordosis, 'shirt with name on it stays visible' (chest up), arms parallel to floor for counterbalance. Squat to box/chair height.",
        "Phase 3 - Sumo Deadlift: Wide stance, toes out, chest up, butt back, weight on heels, active triceps. This retrains safe lifting pattern for return to activity.",
        "SELF-MONITORING: If symptoms peripheralize during activity, stop and perform PPUs. If symptoms persist peripherally after PPUs, reduce activity and contact provider."
      ],
      "teachingPoint": "Home exercise has two components: (1) Directional preference exercises (PPUs) dosed frequently early on — possibly hourly — for threat and pain reduction, tapering as symptoms resolve; and (2) Functional training to correct the faulty movement pattern that caused the injury. Mr. Thompson lifted with a rounded back - he needs to learn the hip hinge pattern to replace that. The progression Hip Hinge → Box Squat → Sumo Deadlift retrains safe movement. As the acute phase resolves, the emphasis shifts from PPUs to avoiding provocative activities and getting stronger."
    },
    {
      "id": "q7",
      "phase": "integration",
      "question": "If Mr. Thompson returns in 2 weeks with 50% improvement but has plateaued despite compliant home exercise, what would you consider? How does NCA help you escape 'McKenzie Purgatory'?",
      "hints": [
        "What other GNE levels might still be involved?",
        "What would skin rolling tell you at this point?",
        "When do you add neurodynamics or DTM?"
      ],
      "expectedConcepts": [
        "McKenzie Purgatory: Patient responds initially to directional preference but plateaus before full resolution",
        "MDT/McKenzie addresses the IVF/nerve root level but may not fully address peripheral nerve or cutaneous involvement",
        "By this point the patient should have been using PPUs to reduce threat and pain early on, and as symptoms improved, reducing PPU frequency while focusing on avoiding provocative activities and getting stronger overall",
        "Re-examine with GNE lens: Is skin rolling still hyperalgesic? Is slump test still positive?",
        "If cutaneous hyperalgesia persists: Add DTM to the hyperalgesic paraspinal and gluteal regions identified on initial exam",
        "If neural tension persists: Add sciatic nerve sliders (not tensioners initially) to improve nerve tract mobility",
        "The CAP guides progression: After DTM or neurodynamics, retest index — if further improvement, you've identified a contributing level MDT alone didn't address",
        "This is the NCA value-add: MDT/McKenzie is powerful but addresses one level. NCA integrates multiple levels for complete resolution."
      ],
      "teachingPoint": "Many patients plateau with MDT/McKenzie alone because other neurological levels remain sensitized. The protective paraspinal tension may have created fascial adhesions affecting cutaneous nerves (like cluneal nerves). The disc may have healed but secondary neural sensitivity persists. NCA's multi-level approach — adding DTM for cutaneous, neurodynamics for peripheral nerve — provides escape from McKenzie Purgatory."
    }
  ],

  "keyTakeaways": [
    "MDT (synonymous with McKenzie): Requires at least 10 reps of end-range loading to determine symptom trend. Centralization with extension = extension IS the directional preference. Don't overcomplicate.",
    "Within-visit symptom modification demonstration builds patient agency - they must SEE it work. Use a controlled exam procedure as the index in acute severe cases.",
    "Extension exercises can push disc contents away from nerve roots, reducing threat. Frame exercises as medicine the patient controls.",
    "PPUs early and often (possibly hourly) for threat/pain reduction. As symptoms resolve, reduce PPU frequency, avoid provocative activities, and focus on getting stronger.",
    "ADL modification is essential: hip hinge at sink, golfer's pick-up, Cat/Camel for AM",
    "Functional training progression: Hip Hinge → Box Squat → Sumo Deadlift corrects faulty movement patterns",
    "McKenzie Purgatory: If plateau occurs, use GNE to identify other levels (cutaneous, peripheral nerve) and add DTM/neurodynamics",
    "Paraspinal hypertonicity is protective - don't aggressively release before reducing neural threat"
  ],

  "paceMetadata": {
    "learningObjectives": [
      "Identify red flags in patients presenting with low back pain and radiculopathy",
      "Organize neurological findings using the Graded Neuro Exam (GNE) framework",
      "Distinguish neurocentric vs mesodermal clinical reasoning for disc herniation",
      "Apply the Clinical Audit Process (CAP) to demonstrate within-visit symptom modification",
      "Design a home exercise program incorporating directional preference and functional training progression"
    ],
    "creditHours": 1.0,
    "estimatedMinutes": 50,
    "creditHourJustification": "Case includes 7 Socratic questions spanning assessment, conceptualization, diagnosis, treatment, home exercise, and integration phases requiring active clinical reasoning.",
    "targetAudience": "Licensed chiropractors, physical therapists, osteopaths, and other neuromusculoskeletal clinicians",
    "prerequisites": "Basic neuromusculoskeletal assessment skills; familiarity with lumbar spine anatomy",
    "author": { "name": "Dr. Patrick Snell", "credentials": "DC" },
    "conflictOfInterest": "Dr. Patrick Snell is the developer of the NeuroCentric Approach methodology and owner of Solutions Sports and Spine.",
    "educationalMethods": ["case-based learning", "Socratic questioning", "self-assessment"],
    "completionCriteria": {
      "allQuestionsAnswered": true,
      "selfAssessmentRequired": true,
      "postActivityEvaluationRequired": true,
      "minimumActiveMinutes": 50
    }
  },

  "references": [
    "McKenzie R. The Lumbar Spine: Mechanical Diagnosis and Therapy",
    "McKenzie R. Treat Your Own Back",
    "NCA Clinical Companion to Fix Your Own Back",
    "Butler D. The Sensitive Nervous System",
    "Shacklock M. Clinical Neurodynamics",
    "McGill S. Back Mechanic",
    "NCA Theory Module 1"
  ]
}
