{
  "id": "draft-002",
  "status": "draft",
  "title": "The Remote Worker",
  "difficulty": "intermediate",
  "region": "upper_quarter",
  "primaryConcepts": ["cervical_radiculitis", "brachial_plexus", "cutaneous_nerves", "DTM", "clinical_audit_process"],

  "presentation": {
    "demographics": {
      "age": 51,
      "sex": "Female",
      "occupation": "Marketing Director"
    },
    "chiefComplaint": "Right shoulder and arm pain for 4 months, worsening over past 6 weeks.",
    "hpiNarrative": "Ms. Garcia is a 51-year-old marketing director who presents with right shoulder and lateral arm pain that has been present for approximately 4 months but has significantly worsened over the past 6 weeks. The pain began insidiously with neck stiffness that she initially managed with weekly massage therapy. Since transitioning to full-time remote work 6 months ago, she has been working longer hours (50-60 hours/week) on a laptop at her kitchen table without proper ergonomic setup. She describes the pain as a deep ache in the posterior shoulder that radiates to the lateral arm, occasionally reaching the dorsum of her forearm. The pain is worse with overhead activities, reaching behind her back, and prolonged computer work. She notes the pain sometimes wakes her at night when she rolls onto her right side. She denies numbness or tingling but reports the arm occasionally feels 'heavy.' She previously received a diagnosis of rotator cuff impingement from her PCP and completed 6 weeks of physical therapy focusing on rotator cuff strengthening and stretching with minimal improvement. She was also previously diagnosed with carpal tunnel syndrome 3 years ago, treated conservatively.",
    "pastMedicalHistory": [
      "Carpal tunnel syndrome - right, diagnosed 3 years ago, managed with splinting",
      "Prior neck stiffness episodes - managed with massage",
      "Hyperlipidemia",
      "No spine imaging"
    ],
    "socialHistory": {
      "occupation": "Remote work, 50-60 hours/week at non-ergonomic home workstation",
      "exercise": "Previously attended gym 3x/week, stopped 8 months ago",
      "smoking": "Never",
      "alcohol": "1-2 glasses wine weekly",
      "stress": "High - increased workload, team management challenges"
    },
    "medicationsAllergies": {
      "current": ["Atorvastatin 20mg daily", "Acetaminophen PRN"],
      "allergies": "Sulfa drugs"
    }
  },

  "physicalExam": {
    "observation": "Sits with forward head posture and rounded shoulders. Right shoulder slightly elevated. Holds right arm close to body. Frequent position changes during interview.",
    "cervicalROM": {
      "flexion": "Full, mild end-range discomfort",
      "extension": "Limited to 60% with local neck pain",
      "rightRotation": "Limited to 70% with right neck/shoulder pain",
      "leftRotation": "Full range",
      "rightLateralFlexion": "Limited to 60%",
      "leftLateralFlexion": "Full range"
    },
    "shoulderROM": {
      "flexion": "160 degrees with pain arc 90-120 degrees",
      "abduction": "150 degrees with pain at 90-110 degrees",
      "internalRotation": "Markedly limited - hand reaches only to L3",
      "externalRotation": "Full range with mild discomfort"
    },
    "neurological": {
      "motorTesting": {
        "shoulderAbduction": "5/5 bilateral",
        "elbowFlexion": "5/5 bilateral",
        "elbowExtension": "5/5 bilateral",
        "wristExtension": "5/5 bilateral",
        "gripStrength": "5/5 bilateral"
      },
      "sensory": "Intact to light touch throughout, no dermatomal deficit",
      "reflexes": {
        "biceps": "2+ bilateral",
        "triceps": "2+ bilateral",
        "brachioradialis": "2+ bilateral"
      }
    },
    "specialTests": {
      "spurlings": "Negative for radicular symptoms, positive for local neck pain",
      "cervicalDistraction": "Positive - shoulder abduction improved and less painful with manual cervical traction",
      "ULNTT_median": "Negative",
      "ULNTT_radial": "Negative",
      "ULNTT_ulnar": "Positive right - reproduces shoulder pain, worsened with contralateral cervical lateral flexion",
      "hawkinsKennedy": "Positive right",
      "neer": "Positive right",
      "emptyCanYocum": "Negative",
      "resisted_IR": "Negative"
    },
    "ncaSpecificFindings": {
      "skinRolling": {
        "posteriorShoulder": "Marked hyperalgesia right posterior deltoid region",
        "axillaryRegion": "Hyperalgesia along distribution of axillary nerve",
        "cervicalParaspinals": "Mild hyperalgesia C5-7 right"
      },
      "mckenzieResponse": {
        "cervicalRetractions": "Increased shoulder pain after 10 reps",
        "cervicalRetractionsWithExtension": "No change",
        "cervicalRetractionsWithExtensionAndRightRotation": "Decreased shoulder pain after 10 reps, improved abduction ROM"
      },
      "tractionTest": "With examiner providing manual cervical traction, patient performs shoulder abduction - pain reduced from 6/10 to 2/10",
      "indexMovement": "Shoulder abduction - pain 6/10 at 100 degrees",
      "postDTMResponse": "After DTM to posterior shoulder/axillary region, shoulder abduction pain reduced to 3/10"
    },
    "palpation": "Tenderness right upper trapezius, levator scapulae, infraspinatus. Nodular thickening posterior shoulder. Cervical paraspinal hypertonicity C4-7 right."
  },

  "socraticQuestions": [
    {
      "id": "q1",
      "phase": "assessment",
      "question": "This patient was previously diagnosed with rotator cuff impingement and treated accordingly without improvement. Using the GNE framework, how would you organize your assessment findings? What does each level reveal?",
      "hints": [
        "What brain-level factors from history might contribute?",
        "What does the positive cervical distraction test tell you about the nerve root level?",
        "What does the ULNTT finding indicate about peripheral nerves?",
        "What do the skin rolling findings suggest?"
      ],
      "expectedConcepts": [
        "Brain: High stress, health anxiety from failed treatment, prior CTS diagnosis may create expectation of nerve problems",
        "Cellular: Sedentary since stopped exercising, high work stress - inflammatory contributors",
        "Spinal cord/nerve root/IVF: Positive distraction test suggests nerve root involvement - traction reduces compression/improves perfusion, symptoms improve with abduction",
        "Peripheral nerves: Positive ULNTT for ulnar nerve with cervical modulation indicates peripheral nerve mechanical sensitivity along ulnar tract",
        "Cutaneous: Hyperalgesia on skin rolling over posterior shoulder and axillary region indicates sensitized superficial neurology (likely axillary nerve distribution)"
      ],
      "teachingPoint": "The GNE reveals multi-level involvement. The failed rotator cuff treatment makes sense - the primary driver is neurological (cervical and peripheral), not primarily mesodermal. The 'impingement' signs (Hawkins, Neer) may be positive because sensitized neurology is causing altered motor control and joint centration issues."
    },
    {
      "id": "q2",
      "phase": "assessment",
      "question": "Explain the significance of the positive cervical distraction test combined with the ULNTT findings. What is the mechanical relationship between these findings?",
      "hints": [
        "What does traction do to the IVF?",
        "How does nerve root irritation affect downstream peripheral neurology?",
        "What is the concept of 'double crush'?"
      ],
      "expectedConcepts": [
        "Cervical distraction opens the IVF, reducing compression on nerve roots and improving perfusion",
        "When traction improves distal symptoms (shoulder abduction), it suggests nerve root involvement as a proximal driver",
        "The ulnar nerve originates from C8-T1; mechanical sensitivity at the root level can sensitize the entire peripheral nerve tract (double crush concept)",
        "Upstream compression reduces axonal transport and perfusion, making the nerve more vulnerable to downstream compression points",
        "This explains why she also had prior CTS - the entire neural tract from cervical spine to hand may be sensitized"
      ],
      "teachingPoint": "Elvey's concept that 'muscles protect nerves' and the double crush phenomenon explain how cervical involvement can manifest as shoulder and arm symptoms. The brachial plexus and its branches are one continuous tissue - irritation anywhere along the tract affects the whole system."
    },
    {
      "id": "q3",
      "phase": "conceptualization",
      "question": "The patient has positive Hawkins-Kennedy and Neer tests. How does the neurocentric approach explain these findings differently than a traditional rotator cuff impingement diagnosis?",
      "hints": [
        "What is the innervation of the shoulder capsule?",
        "How might sensitized neurology affect muscle behavior?",
        "What happens to joint centration when protective muscle guarding is present?"
      ],
      "expectedConcepts": [
        "Traditional view: Positive impingement tests indicate mechanical compression of supraspinatus tendon under acromion",
        "Neurocentric view: The nerves innervating the capsule (suprascapular, axillary) may be mechanically sensitive",
        "Sensitized nerves cause protective muscle guarding which can decentrate the humeral head",
        "Decentrated humeral head creates impingement-like mechanics secondarily",
        "The negative resisted IR and empty can tests suggest the rotator cuff tendons themselves are not the primary issue",
        "The skin rolling hyperalgesia over axillary nerve distribution supports primary neural involvement"
      ],
      "teachingPoint": "Impingement tests can be positive for neurological reasons. Sensitized neurology alters motor programs and muscle recruitment, leading to joint decentration. This creates secondary mechanical impingement. Treating the impingement without addressing the neural driver will fail - as it did in this patient's prior PT."
    },
    {
      "id": "q4",
      "phase": "treatment",
      "question": "Demonstrate the Clinical Audit Process (CAP) for this patient. Show how you would sequence interventions and use the index movement to validate effectiveness.",
      "hints": [
        "What is the index movement?",
        "What did each intervention level do to the index movement?",
        "How do you sequence from bigger to smaller neuro?"
      ],
      "expectedConcepts": [
        "Index movement: Shoulder abduction - 6/10 pain at 100 degrees",
        "Level 1 - Nerve root (biggest): Cervical retractions with extension and right rotation → Retest abduction → Document change",
        "Level 2 - Peripheral: If ulnar neurodynamics indicated, perform sliders → Retest → Document",
        "Level 3 - Cutaneous: DTM to posterior shoulder/axillary region → Retest → Post-DTM abduction pain 3/10 (50% improvement)",
        "The CAP showed: Manual cervical traction → improved abduction; DTM → further improved abduction",
        "This validates that multiple neurological levels are contributing and both need to be addressed"
      ],
      "teachingPoint": "The CAP provides immediate, objective feedback. When shoulder abduction improved from 6/10 to 2/10 with cervical traction and to 3/10 after DTM, we have validated our neurocentric hypothesis. This builds patient confidence and rapport while guiding treatment planning."
    },
    {
      "id": "q5",
      "phase": "diagnosis",
      "question": "Formulate a working diagnosis using neurocentric terminology. How does this differ from the prior diagnosis of 'rotator cuff impingement'?",
      "hints": [
        "What structures are primarily involved?",
        "Is this primarily ectodermal or mesodermal?",
        "How would you communicate this to the patient?"
      ],
      "expectedConcepts": [
        "Working diagnosis: Cervical radiculitis with secondary brachial plexopathy and axillary nerve mechanical sensitivity",
        "Alternative framing: Upper quarter neural tension syndrome with cervical driver",
        "This is primarily an ectodermal (neurological) condition, not mesodermal (structural shoulder)",
        "The 'impingement' is secondary to neural-driven motor control dysfunction",
        "Patient communication: 'The nerves from your neck that go to your shoulder have become irritated, probably from your work posture. This is causing your shoulder muscles to tighten up to protect those nerves, which makes your shoulder not move properly. We need to calm down the nerve irritation first.'",
        "Prognosis: Much better than true rotator cuff pathology - likely significant improvement in days to weeks vs months"
      ],
      "teachingPoint": "Reframing the diagnosis changes the treatment approach and prognosis. A neurocentric diagnosis of cervical radiculitis with peripheral neural sensitization explains the failed prior treatment and predicts rapid improvement with appropriate neural-focused intervention."
    },
    {
      "id": "q6",
      "phase": "homeExercise",
      "question": "Design a home exercise program for this patient. Include self-treatment techniques, ergonomic modifications, and clear dosing instructions.",
      "hints": [
        "Based on McKenzie response, what cervical exercises?",
        "Can the patient perform self-DTM?",
        "What ergonomic changes are critical?",
        "What should she avoid?"
      ],
      "expectedConcepts": [
        "Cervical exercises: Retractions with extension and right rotation, 10 reps every 2 hours",
        "Self-DTM: Teach patient to perform skin traction over posterior shoulder using opposite hand, 30-60 seconds, 3-4x daily",
        "Ergonomic modifications: Proper desk setup (monitor at eye level, external keyboard, chair with lumbar support), standing desk intervals",
        "Movement breaks: Every 30-45 minutes, perform cervical retractions and shoulder rolls",
        "Avoid: Prolonged static postures, sleeping on right side, heavy lifting overhead",
        "Postural awareness: Chin tucks throughout day, avoid forward head posture",
        "Graded return to exercise: Start with walking, gradually reintroduce gym with attention to posture"
      ],
      "teachingPoint": "Home program addresses all contributing factors: neural mobilization (cervical exercises), cutaneous desensitization (self-DTM), and environmental modification (ergonomics). The patient must understand that the home exercises are the treatment - clinic visits reinforce and progress the program."
    }
  ],

  "keyTakeaways": [
    "Failed treatment may indicate wrong diagnosis - reassess through neurocentric lens",
    "Positive impingement tests can have neurological etiology - sensitized nerves alter motor control",
    "The GNE reveals multi-level involvement that single-structure diagnosis misses",
    "Double crush: proximal neural irritation sensitizes entire peripheral nerve tract",
    "CAP validates clinical reasoning with objective within-session changes",
    "DTM addresses cutaneous nerve involvement not reached by traditional soft tissue work"
  ],

  "paceMetadata": {
    "learningObjectives": [
      "Apply the GNE framework to organize multi-level neurological findings in the upper quarter",
      "Explain the double crush hypothesis and its clinical implications for brachial plexopathy",
      "Differentiate neurocentric shoulder pathology from traditional rotator cuff impingement",
      "Demonstrate the Clinical Audit Process (CAP) for sequencing upper quarter interventions",
      "Design an ergonomic-informed home program addressing cervical, peripheral, and cutaneous nerve involvement"
    ],
    "creditHours": 1.0,
    "estimatedMinutes": 50,
    "creditHourJustification": "Case includes 6 Socratic questions covering assessment, conceptualization, diagnosis, treatment, and home exercise phases with emphasis on failed prior treatment reframing.",
    "targetAudience": "Licensed chiropractors, physical therapists, osteopaths, and other neuromusculoskeletal clinicians",
    "prerequisites": "Basic neuromusculoskeletal assessment skills; familiarity with cervical spine and upper extremity anatomy",
    "author": { "name": "Dr. Patrick Snell", "credentials": "DC" },
    "conflictOfInterest": "Dr. Patrick Snell is the developer of the NeuroCentric Approach methodology and owner of Solutions Sports and Spine.",
    "educationalMethods": ["case-based learning", "Socratic questioning", "self-assessment"],
    "completionCriteria": {
      "allQuestionsAnswered": true,
      "selfAssessmentRequired": true,
      "postActivityEvaluationRequired": true,
      "minimumActiveMinutes": 50
    }
  },

  "references": [
    "Elvey RL. Treatment of arm pain associated with abnormal brachial plexus tension",
    "Shacklock M. Clinical Neurodynamics",
    "Butler D. The Sensitive Nervous System",
    "Maitland G. Peripheral Manipulation",
    "NCA Theory Module 1 - Upper Quarter Case Study"
  ]
}
